# CoverOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..CoverOffset Property
FabricArea Class See Also
---
The additional cover offset of the fabric distribution.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double CoverOffset { get; set; }
```

Visual Basic
---
```text
Public Property CoverOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CoverOffset {
	double get ();
	void set (double value);
}
```

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace